STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255dxx_ca35.h
/******************  Bit definition for EXTI1_SWIER2 register  ******************/
#define EXTI1_SWIER2_SWI43_Pos    (11U)
#define EXTI1_SWIER2_SWI43_Msk    (0x1UL << EXTI1_SWIER2_SWI43_Pos)           /*!< 0x00000800 */
#define EXTI1_SWIER2_SWI43        EXTI1_SWIER2_SWI43_Msk                     /*!< Software Interrupt on line 49 */
#define EXTI1_SWIER2_SWI44_Pos    (12U)
#define EXTI1_SWIER2_SWI44_Msk    (0x1UL << EXTI1_SWIER2_SWI44_Pos)           /*!< 0x00001000 */
#define EXTI1_SWIER2_SWI44        EXTI1_SWIER2_SWI44_Msk                     /*!< Software Interrupt on line 51 */
#define EXTI1_SWIER2_SWI45_Pos    (13U)
#define EXTI1_SWIER2_SWI45_Msk    (0x1UL << EXTI1_SWIER2_SWI45_Pos)           /*!< 0x00002000 */
#define EXTI1_SWIER2_SWI45        EXTI1_SWIER2_SWI45_Msk                     /*!< Software Interrupt on line 51 */

/******************  Bit definition for EXTI1_RPR2 register  *******************/
#define EXTI1_RPR2_RPIF43_Pos        (11U)
#define EXTI1_RPR2_RPIF43_Msk        (0x1UL << EXTI1_RPR2_RPIF43_Pos)               /*!< 0x00000800 */
#define EXTI1_RPR2_RPIF43            EXTI1_RPR2_RPIF43_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI1_RPR2_RPIF44_Pos        (12U)
#define EXTI1_RPR2_RPIF44_Msk        (0x1UL << EXTI1_RPR2_RPIF44_Pos)               /*!< 0x00001000 */
#define EXTI1_RPR2_RPIF44            EXTI1_RPR2_RPIF44_Msk                         /*!< Rising trigger event configuration bit of line 51 */
#define EXTI1_RPR2_RPIF45_Pos        (13U)
#define EXTI1_RPR2_RPIF45_Msk        (0x1UL << EXTI1_RPR2_RPIF45_Pos)               /*!< 0x00002000 */
#define EXTI1_RPR2_RPIF45            EXTI1_RPR2_RPIF45_Msk                         /*!< Rising trigger event configuration bit of line 51 */

/******************  Bit definition for EXTI1_FPR2 register  *******************/
#define EXTI1_FPR2_FPIF43_Pos        (11U)
#define EXTI1_FPR2_FPIF43_Msk        (0x1UL << EXTI1_FPR2_FPIF43_Pos)               /*!< 0x00000800 */
#define EXTI1_FPR2_FPIF43            EXTI1_FPR2_FPIF43_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI1_FPR2_FPIF44_Pos        (12U)
#define EXTI1_FPR2_FPIF44_Msk        (0x1UL << EXTI1_FPR2_FPIF44_Pos)               /*!< 0x00001000 */
#define EXTI1_FPR2_FPIF44            EXTI1_FPR2_FPIF44_Msk                         /*!< Rising trigger event configuration bit of line 51 */
#define EXTI1_FPR2_FPIF45_Pos        (13U)
#define EXTI1_FPR2_FPIF45_Msk        (0x1UL << EXTI1_FPR2_FPIF45_Pos)               /*!< 0x00002000 */
#define EXTI1_FPR2_FPIF45            EXTI1_FPR2_FPIF45_Msk                         /*!< Rising trigger event configuration bit of line 51 */

/******************  Bit definition for EXTI1_SECCFGR2  register  ******************/
#define EXTI1_SECCFGR2_SEC32_Pos  (0U)
#define EXTI1_SECCFGR2_SEC32_Msk  (0x1UL << EXTI1_SECCFGR2_SEC32_Pos)          /*!< 0x00000001 */
#define EXTI1_SECCFGR2_SEC32      EXTI1_SECCFGR2_SEC32_Msk                    /*!< SEC/PRIV enable on event input 32 */
#define EXTI1_SECCFGR2_SEC33_Pos  (1U)
#define EXTI1_SECCFGR2_SEC33_Msk  (0x1UL << EXTI1_SECCFGR2_SEC33_Pos)          /*!< 0x00000002 */
#define EXTI1_SECCFGR2_SEC33      EXTI1_SECCFGR2_SEC33_Msk                    /*!< SEC/PRIV enable on event input 33 */
#define EXTI1_SECCFGR2_SEC34_Pos  (2U)
#define EXTI1_SECCFGR2_SEC34_Msk  (0x1UL << EXTI1_SECCFGR2_SEC34_Pos)          /*!< 0x00000004 */
#define EXTI1_SECCFGR2_SEC34      EXTI1_SECCFGR2_SEC34_Msk                    /*!< SEC/PRIV enable on event input 34 */
/* no event input 35  */
#define EXTI1_SECCFGR2_SEC36_Pos  (4U)
#define EXTI1_SECCFGR2_SEC36_Msk  (0x1UL << EXTI1_SECCFGR2_SEC36_Pos)          /*!< 0x00000010 */
#define EXTI1_SECCFGR2_SEC36      EXTI1_SECCFGR2_SEC36_Msk                    /*!< SEC/PRIV enable on event input 36 */
#define EXTI1_SECCFGR2_SEC37_Pos  (5U)
#define EXTI1_SECCFGR2_SEC37_Msk  (0x1UL << EXTI1_SECCFGR2_SEC37_Pos)          /*!< 0x00000020 */
#define EXTI1_SECCFGR2_SEC37      EXTI1_SECCFGR2_SEC37_Msk                    /*!< SEC/PRIV enable on event input 37 */
#define EXTI1_SECCFGR2_SEC38_Pos  (6U)
#define EXTI1_SECCFGR2_SEC38_Msk  (0x1UL << EXTI1_SECCFGR2_SEC38_Pos)          /*!< 0x00000040 */
#define EXTI1_SECCFGR2_SEC38      EXTI1_SECCFGR2_SEC38_Msk                    /*!< SEC/PRIV enable on event input 38 */
#define EXTI1_SECCFGR2_SEC39_Pos  (7U)
#define EXTI1_SECCFGR2_SEC39_Msk  (0x1UL << EXTI1_SECCFGR2_SEC39_Pos)          /*!< 0x00000080 */
#define EXTI1_SECCFGR2_SEC39      EXTI1_SECCFGR2_SEC39_Msk                    /*!< SEC/PRIV enable on event input 39 */
#define EXTI1_SECCFGR2_SEC40_Pos  (8U)
#define EXTI1_SECCFGR2_SEC40_Msk  (0x1UL << EXTI1_SECCFGR2_SEC40_Pos)          /*!< 0x00000100 */
#define EXTI1_SECCFGR2_SEC40      EXTI1_SECCFGR2_SEC40_Msk                    /*!< SEC/PRIV enable on event input 40 */
#define EXTI1_SECCFGR2_SEC41_Pos  (9U)
#define EXTI1_SECCFGR2_SEC41_Msk  (0x1UL << EXTI1_SECCFGR2_SEC41_Pos)          /*!< 0x00000200 */
#define EXTI1_SECCFGR2_SEC41      EXTI1_SECCFGR2_SEC41_Msk                    /*!< SEC/PRIV enable on event input 41 */
#define EXTI1_SECCFGR2_SEC42_Pos (10U)
#define EXTI1_SECCFGR2_SEC42_Msk (0x1UL << EXTI1_SECCFGR2_SEC42_Pos)         /*!< 0x00000400 */
#define EXTI1_SECCFGR2_SEC42     EXTI1_SECCFGR2_SEC42_Msk                   /*!< SEC/PRIV enable on event input 42 */
#define EXTI1_SECCFGR2_SEC43_Pos (11U)
#define EXTI1_SECCFGR2_SEC43_Msk (0x1UL << EXTI1_SECCFGR2_SEC43_Pos)         /*!< 0x00000800 */
#define EXTI1_SECCFGR2_SEC43     EXTI1_SECCFGR2_SEC43_Msk                   /*!< SEC/PRIV enable on event input 43 */
#define EXTI1_SECCFGR2_SEC44_Pos (12U)
#define EXTI1_SECCFGR2_SEC44_Msk (0x1UL << EXTI1_SECCFGR2_SEC44_Pos)         /*!< 0x00001000 */
#define EXTI1_SECCFGR2_SEC44     EXTI1_SECCFGR2_SEC44_Msk                   /*!< SEC/PRIV enable on event input 44 */
#define EXTI1_SECCFGR2_SEC45_Pos (13U)
#define EXTI1_SECCFGR2_SEC45_Msk (0x1UL << EXTI1_SECCFGR2_SEC45_Pos)         /*!< 0x00002000 */
#define EXTI1_SECCFGR2_SEC45     EXTI1_SECCFGR2_SEC45_Msk                   /*!< SEC/PRIV enable on event input 45 */
#define EXTI1_SECCFGR2_SEC46_Pos (14U)
#define EXTI1_SECCFGR2_SEC46_Msk (0x1UL << EXTI1_SECCFGR2_SEC46_Pos)         /*!< 0x00004000 */
#define EXTI1_SECCFGR2_SEC46     EXTI1_SECCFGR2_SEC46_Msk                   /*!< SEC/PRIV enable on event input 46 */
#define EXTI1_SECCFGR2_SEC47_Pos (15U)
#define EXTI1_SECCFGR2_SEC47_Msk (0x1UL << EXTI1_SECCFGR2_SEC47_Pos)         /*!< 0x00008000 */
#define EXTI1_SECCFGR2_SEC47     EXTI1_SECCFGR2_SEC47_Msk                   /*!< SEC/PRIV enable on event input 47 */
#define EXTI1_SECCFGR2_SEC48_Pos (16U)
#define EXTI1_SECCFGR2_SEC48_Msk (0x1UL << EXTI1_SECCFGR2_SEC48_Pos)         /*!< 0x00010000 */
#define EXTI1_SECCFGR2_SEC48     EXTI1_SECCFGR2_SEC48_Msk                   /*!< SEC/PRIV enable on event input 48 */
#define EXTI1_SECCFGR2_SEC49_Pos (17U)
#define EXTI1_SECCFGR2_SEC49_Msk (0x1UL << EXTI1_SECCFGR2_SEC49_Pos)         /*!< 0x00020000 */
#define EXTI1_SECCFGR2_SEC49     EXTI1_SECCFGR2_SEC49_Msk                   /*!< SEC/PRIV enable on event input 49 */
#define EXTI1_SECCFGR2_SEC50_Pos (18U)
#define EXTI1_SECCFGR2_SEC50_Msk (0x1UL << EXTI1_SECCFGR2_SEC50_Pos)         /*!< 0x00040000 */
#define EXTI1_SECCFGR2_SEC50     EXTI1_SECCFGR2_SEC50_Msk                   /*!< SEC/PRIV enable on event input 50 */
/* no event input 51  */
#define EXTI1_SECCFGR2_SEC52_Pos (20U)
#define EXTI1_SECCFGR2_SEC52_Msk (0x1UL << EXTI1_SECCFGR2_SEC52_Pos)         /*!< 0x00080000 */
#define EXTI1_SECCFGR2_SEC52     EXTI1_SECCFGR2_SEC52_Msk                   /*!< SEC/PRIV enable on event input 52 */
#define EXTI1_SECCFGR2_SEC53_Pos (21U)
#define EXTI1_SECCFGR2_SEC53_Msk (0x1UL << EXTI1_SECCFGR2_SEC53_Pos)         /*!< 0x00200000 */
#define EXTI1_SECCFGR2_SEC53     EXTI1_SECCFGR2_SEC53_Msk                   /*!< SEC/PRIV enable on event input 53 */
#define EXTI1_SECCFGR2_SEC54_Pos (22U)
#define EXTI1_SECCFGR2_SEC54_Msk (0x1UL << EXTI1_SECCFGR2_SEC54_Pos)         /*!< 0x00400000 */
#define EXTI1_SECCFGR2_SEC54     EXTI1_SECCFGR2_SEC54_Msk                   /*!< SEC/PRIV enable on event input 54 */
#define EXTI1_SECCFGR2_SEC55_Pos (23U)
#define EXTI1_SECCFGR2_SEC55_Msk (0x1UL << EXTI1_SECCFGR2_SEC55_Pos)         /*!< 0x00800000 */
#define EXTI1_SECCFGR2_SEC55     EXTI1_SECCFGR2_SEC55_Msk                   /*!< SEC/PRIV enable on event input 55 */
#define EXTI1_SECCFGR2_SEC56_Pos (24U)
#define EXTI1_SECCFGR2_SEC56_Msk (0x1UL << EXTI1_SECCFGR2_SEC56_Pos)         /*!< 0x01000000 */
#define EXTI1_SECCFGR2_SEC56     EXTI1_SECCFGR2_SEC56_Msk                   /*!< SEC/PRIV enable on event input 56 */
#define EXTI1_SECCFGR2_SEC57_Pos (25U)
#define EXTI1_SECCFGR2_SEC57_Msk (0x1UL << EXTI1_SECCFGR2_SEC57_Pos)         /*!< 0x02000000 */
#define EXTI1_SECCFGR2_SEC57     EXTI1_SECCFGR2_SEC57_Msk                   /*!< SEC/PRIV enable on event input 57 */
/* no event input 58  */
#define EXTI1_SECCFGR2_SEC59_Pos (27U)
#define EXTI1_SECCFGR2_SEC59_Msk (0x1UL << EXTI1_SECCFGR2_SEC59_Pos)         /*!< 0x08000000 */
#define EXTI1_SECCFGR2_SEC59     EXTI1_SECCFGR2_SEC59_Msk                   /*!< SEC/PRIV enable on event input 59 */
#define EXTI1_SECCFGR2_SEC60_Pos (28U)
#define EXTI1_SECCFGR2_SEC60_Msk (0x1UL << EXTI1_SECCFGR2_SEC60_Pos)         /*!< 0x10000000 */
#define EXTI1_SECCFGR2_SEC60     EXTI1_SECCFGR2_SEC60_Msk                   /*!< SEC/PRIV enable on event input 60 */
#define EXTI1_SECCFGR2_SEC61_Pos (29U)
#define EXTI1_SECCFGR2_SEC61_Msk (0x1UL << EXTI1_SECCFGR2_SEC61_Pos)         /*!< 0x20000000 */
#define EXTI1_SECCFGR2_SEC61     EXTI1_SECCFGR2_SEC61_Msk                   /*!< SEC/PRIV enable on event input 61 */
#define EXTI1_SECCFGR2_SEC62_Pos (30U)
#define EXTI1_SECCFGR2_SEC62_Msk (0x1UL << EXTI1_SECCFGR2_SEC62_Pos)         /*!< 0x40000000 */
#define EXTI1_SECCFGR2_SEC62     EXTI1_SECCFGR2_SEC62_Msk                   /*!< SEC/PRIV enable on event input 62 */
/* no event input 63 */

/******************  Bit definition for EXTI1_PRIVCFGR2 register  ******************/
#define EXTI1_PRIVCFGR2_PRIV32_Pos  (0U)
#define EXTI1_PRIVCFGR2_PRIV32_Msk  (0x1UL << EXTI1_PRIVCFGR2_PRIV32_Pos)          /*!< 0x00000001 */
#define EXTI1_PRIVCFGR2_PRIV32      EXTI1_PRIVCFGR2_PRIV32_Msk                    /*!< SEC/PRIV enable on event input 32 */
#define EXTI1_PRIVCFGR2_PRIV33_Pos  (1U)
#define EXTI1_PRIVCFGR2_PRIV33_Msk  (0x1UL << EXTI1_PRIVCFGR2_PRIV33_Pos)          /*!< 0x00000002 */
#define EXTI1_PRIVCFGR2_PRIV33      EXTI1_PRIVCFGR2_PRIV33_Msk                    /*!< SEC/PRIV enable on event input 33 */
#define EXTI1_PRIVCFGR2_PRIV34_Pos  (2U)
#define EXTI1_PRIVCFGR2_PRIV34_Msk  (0x1UL << EXTI1_PRIVCFGR2_PRIV34_Pos)          /*!< 0x00000004 */
#define EXTI1_PRIVCFGR2_PRIV34      EXTI1_PRIVCFGR2_PRIV34_Msk                    /*!< SEC/PRIV enable on event input 34 */
/* no event input 35  */
#define EXTI1_PRIVCFGR2_PRIV36_Pos  (4U)
#define EXTI1_PRIVCFGR2_PRIV36_Msk  (0x1UL << EXTI1_PRIVCFGR2_PRIV36_Pos)          /*!< 0x00000010 */
#define EXTI1_PRIVCFGR2_PRIV36      EXTI1_PRIVCFGR2_PRIV36_Msk                    /*!< SEC/PRIV enable on event input 36 */
#define EXTI1_PRIVCFGR2_PRIV37_Pos  (5U)
#define EXTI1_PRIVCFGR2_PRIV37_Msk  (0x1UL << EXTI1_PRIVCFGR2_PRIV37_Pos)          /*!< 0x00000020 */
#define EXTI1_PRIVCFGR2_PRIV37      EXTI1_PRIVCFGR2_PRIV37_Msk                    /*!< SEC/PRIV enable on event input 37 */
#define EXTI1_PRIVCFGR2_PRIV38_Pos  (6U)
#define EXTI1_PRIVCFGR2_PRIV38_Msk  (0x1UL << EXTI1_PRIVCFGR2_PRIV38_Pos)          /*!< 0x00000040 */
#define EXTI1_PRIVCFGR2_PRIV38      EXTI1_PRIVCFGR2_PRIV38_Msk                    /*!< SEC/PRIV enable on event input 38 */
#define EXTI1_PRIVCFGR2_PRIV39_Pos  (7U)
#define EXTI1_PRIVCFGR2_PRIV39_Msk  (0x1UL << EXTI1_PRIVCFGR2_PRIV39_Pos)          /*!< 0x00000080 */
#define EXTI1_PRIVCFGR2_PRIV39      EXTI1_PRIVCFGR2_PRIV39_Msk                    /*!< SEC/PRIV enable on event input 39 */
#define EXTI1_PRIVCFGR2_PRIV40_Pos  (8U)
#define EXTI1_PRIVCFGR2_PRIV40_Msk  (0x1UL << EXTI1_PRIVCFGR2_PRIV40_Pos)          /*!< 0x00000100 */
#define EXTI1_PRIVCFGR2_PRIV40      EXTI1_PRIVCFGR2_PRIV40_Msk                    /*!< SEC/PRIV enable on event input 40 */
#define EXTI1_PRIVCFGR2_PRIV41_Pos  (9U)
#define EXTI1_PRIVCFGR2_PRIV41_Msk  (0x1UL << EXTI1_PRIVCFGR2_PRIV41_Pos)          /*!< 0x00000200 */
#define EXTI1_PRIVCFGR2_PRIV41      EXTI1_PRIVCFGR2_PRIV41_Msk                    /*!< SEC/PRIV enable on event input 41 */
#define EXTI1_PRIVCFGR2_PRIV42_Pos (10U)
#define EXTI1_PRIVCFGR2_PRIV42_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV42_Pos)         /*!< 0x00000400 */
#define EXTI1_PRIVCFGR2_PRIV42     EXTI1_PRIVCFGR2_PRIV42_Msk                   /*!< SEC/PRIV enable on event input 42 */
#define EXTI1_PRIVCFGR2_PRIV43_Pos (11U)
#define EXTI1_PRIVCFGR2_PRIV43_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV43_Pos)         /*!< 0x00000800 */
#define EXTI1_PRIVCFGR2_PRIV43     EXTI1_PRIVCFGR2_PRIV43_Msk                   /*!< SEC/PRIV enable on event input 43 */
#define EXTI1_PRIVCFGR2_PRIV44_Pos (12U)
#define EXTI1_PRIVCFGR2_PRIV44_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV44_Pos)         /*!< 0x00001000 */
#define EXTI1_PRIVCFGR2_PRIV44     EXTI1_PRIVCFGR2_PRIV44_Msk                   /*!< SEC/PRIV enable on event input 44 */
#define EXTI1_PRIVCFGR2_PRIV45_Pos (13U)
#define EXTI1_PRIVCFGR2_PRIV45_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV45_Pos)         /*!< 0x00002000 */
#define EXTI1_PRIVCFGR2_PRIV45     EXTI1_PRIVCFGR2_PRIV45_Msk                   /*!< SEC/PRIV enable on event input 45 */
#define EXTI1_PRIVCFGR2_PRIV46_Pos (14U)
#define EXTI1_PRIVCFGR2_PRIV46_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV46_Pos)         /*!< 0x00004000 */
#define EXTI1_PRIVCFGR2_PRIV46     EXTI1_PRIVCFGR2_PRIV46_Msk                   /*!< SEC/PRIV enable on event input 46 */
#define EXTI1_PRIVCFGR2_PRIV47_Pos (15U)
#define EXTI1_PRIVCFGR2_PRIV47_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV47_Pos)         /*!< 0x00008000 */
#define EXTI1_PRIVCFGR2_PRIV47     EXTI1_PRIVCFGR2_PRIV47_Msk                   /*!< SEC/PRIV enable on event input 47 */
#define EXTI1_PRIVCFGR2_PRIV48_Pos (16U)
#define EXTI1_PRIVCFGR2_PRIV48_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV48_Pos)         /*!< 0x00010000 */
#define EXTI1_PRIVCFGR2_PRIV48     EXTI1_PRIVCFGR2_PRIV48_Msk                   /*!< SEC/PRIV enable on event input 48 */
#define EXTI1_PRIVCFGR2_PRIV49_Pos (17U)
#define EXTI1_PRIVCFGR2_PRIV49_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV49_Pos)         /*!< 0x00020000 */
#define EXTI1_PRIVCFGR2_PRIV49     EXTI1_PRIVCFGR2_PRIV49_Msk                   /*!< SEC/PRIV enable on event input 49 */
#define EXTI1_PRIVCFGR2_PRIV50_Pos (18U)
#define EXTI1_PRIVCFGR2_PRIV50_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV50_Pos)         /*!< 0x00040000 */
#define EXTI1_PRIVCFGR2_PRIV50     EXTI1_PRIVCFGR2_PRIV50_Msk                   /*!< SEC/PRIV enable on event input 50 */
/* no event input 51  */
#define EXTI1_PRIVCFGR2_PRIV52_Pos (20U)
#define EXTI1_PRIVCFGR2_PRIV52_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV52_Pos)         /*!< 0x00080000 */
#define EXTI1_PRIVCFGR2_PRIV52     EXTI1_PRIVCFGR2_PRIV52_Msk                   /*!< SEC/PRIV enable on event input 52 */
#define EXTI1_PRIVCFGR2_PRIV53_Pos (21U)
#define EXTI1_PRIVCFGR2_PRIV53_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV53_Pos)         /*!< 0x00200000 */
#define EXTI1_PRIVCFGR2_PRIV53     EXTI1_PRIVCFGR2_PRIV53_Msk                   /*!< SEC/PRIV enable on event input 53 */
#define EXTI1_PRIVCFGR2_PRIV54_Pos (22U)
#define EXTI1_PRIVCFGR2_PRIV54_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV54_Pos)         /*!< 0x00400000 */
#define EXTI1_PRIVCFGR2_PRIV54     EXTI1_PRIVCFGR2_PRIV54_Msk                   /*!< SEC/PRIV enable on event input 54 */
#define EXTI1_PRIVCFGR2_PRIV55_Pos (23U)
#define EXTI1_PRIVCFGR2_PRIV55_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV55_Pos)         /*!< 0x00800000 */
#define EXTI1_PRIVCFGR2_PRIV55     EXTI1_PRIVCFGR2_PRIV55_Msk                   /*!< SEC/PRIV enable on event input 55 */
#define EXTI1_PRIVCFGR2_PRIV56_Pos (24U)
#define EXTI1_PRIVCFGR2_PRIV56_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV56_Pos)         /*!< 0x01000000 */
#define EXTI1_PRIVCFGR2_PRIV56     EXTI1_PRIVCFGR2_PRIV56_Msk                   /*!< SEC/PRIV enable on event input 56 */
#define EXTI1_PRIVCFGR2_PRIV57_Pos (25U)
#define EXTI1_PRIVCFGR2_PRIV57_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV57_Pos)         /*!< 0x02000000 */
#define EXTI1_PRIVCFGR2_PRIV57     EXTI1_PRIVCFGR2_PRIV57_Msk                   /*!< SEC/PRIV enable on event input 57 */
/* no event input 58  */
#define EXTI1_PRIVCFGR2_PRIV59_Pos (27U)
#define EXTI1_PRIVCFGR2_PRIV59_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV59_Pos)         /*!< 0x08000000 */
#define EXTI1_PRIVCFGR2_PRIV59     EXTI1_PRIVCFGR2_PRIV59_Msk                   /*!< SEC/PRIV enable on event input 59 */
#define EXTI1_PRIVCFGR2_PRIV60_Pos (28U)
#define EXTI1_PRIVCFGR2_PRIV60_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV60_Pos)         /*!< 0x10000000 */
#define EXTI1_PRIVCFGR2_PRIV60     EXTI1_PRIVCFGR2_PRIV60_Msk                   /*!< SEC/PRIV enable on event input 60 */
#define EXTI1_PRIVCFGR2_PRIV61_Pos (29U)
#define EXTI1_PRIVCFGR2_PRIV61_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV61_Pos)         /*!< 0x20000000 */
#define EXTI1_PRIVCFGR2_PRIV61     EXTI1_PRIVCFGR2_PRIV61_Msk                   /*!< SEC/PRIV enable on event input 61 */
#define EXTI1_PRIVCFGR2_PRIV62_Pos (30U)
#define EXTI1_PRIVCFGR2_PRIV62_Msk (0x1UL << EXTI1_PRIVCFGR2_PRIV62_Pos)         /*!< 0x40000000 */
#define EXTI1_PRIVCFGR2_PRIV62     EXTI1_PRIVCFGR2_PRIV62_Msk                   /*!< SEC/PRIV enable on event input 62 */
/* no event input 63 */

/******************  Bit definition for EXTI1_RTSR3 register  *******************/
#define EXTI1_RTSR3_RT64_Pos        (0U)
#define EXTI1_RTSR3_RT64_Msk        (0x1UL << EXTI1_RTSR3_RT64_Pos)               /*!< 0x00000001 */
#define EXTI1_RTSR3_RT64            EXTI1_RTSR3_RT64_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_RTSR3_RT65_Pos        (1U)
#define EXTI1_RTSR3_RT65_Msk        (0x1UL << EXTI1_RTSR3_RT65_Pos)               /*!< 0x00000002 */
#define EXTI1_RTSR3_RT65            EXTI1_RTSR3_RT65_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI1_RTSR3_RT67_Pos        (3U)
#define EXTI1_RTSR3_RT67_Msk        (0x1UL << EXTI1_RTSR3_RT67_Pos)               /*!< 0x00000008 */
#define EXTI1_RTSR3_RT67            EXTI1_RTSR3_RT67_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_RTSR3_RT73_Pos        (9U)
#define EXTI1_RTSR3_RT73_Msk        (0x1UL << EXTI1_RTSR3_RT73_Pos)               /*!< 0x00400000 */
#define EXTI1_RTSR3_RT73            EXTI1_RTSR3_RT73_Msk                         /*!< Rising trigger event configuration bit of line 86 */
#define EXTI1_RTSR3_RT83_Pos        (19U)
#define EXTI1_RTSR3_RT83_Msk        (0x1UL << EXTI1_RTSR3_RT83_Pos)               /*!< 0x00080000 */
#define EXTI1_RTSR3_RT83            EXTI1_RTSR3_RT83_Msk                         /*!< Rising trigger event configuration bit of line 85 */
#define EXTI1_RTSR3_RT84_Pos        (20U)
#define EXTI1_RTSR3_RT84_Msk        (0x1UL << EXTI1_RTSR3_RT84_Pos)               /*!< 0x00100000 */
#define EXTI1_RTSR3_RT84            EXTI1_RTSR3_RT84_Msk                         /*!< Rising trigger event configuration bit of line 86 */

