STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255dxx_ca35.h
/*****************  Bit definition for LVDS_PMSCR2 register  ******************/
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos                       (0U)
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_Msk                       (0xFFUL << LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos)                      /*!< 0x000000FF */
#define LVDS_PMSCR2_MST_DRV_A4_SPARE                           LVDS_PMSCR2_MST_DRV_A4_SPARE_Msk                                 /*!< Spare inputs for data lane4 */
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_0                         (0x1UL << LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos)                       /*!< 0x00000001 */
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_1                         (0x2UL << LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos)                       /*!< 0x00000002 */
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_2                         (0x4UL << LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos)                       /*!< 0x00000004 */
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_3                         (0x8UL << LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos)                       /*!< 0x00000008 */
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_4                         (0x10UL << LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos)                      /*!< 0x00000010 */
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_5                         (0x20UL << LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos)                      /*!< 0x00000020 */
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_6                         (0x40UL << LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos)                      /*!< 0x00000040 */
#define LVDS_PMSCR2_MST_DRV_A4_SPARE_7                         (0x80UL << LVDS_PMSCR2_MST_DRV_A4_SPARE_Pos)                      /*!< 0x00000080 */

/*****************  Bit definition for LVDS_PMBCR1 register  ******************/
#define LVDS_PMBCR1_MST_EN_BIAS_DL0_Pos                        (0U)
#define LVDS_PMBCR1_MST_EN_BIAS_DL0_Msk                        (0x1UL << LVDS_PMBCR1_MST_EN_BIAS_DL0_Pos)                        /*!< 0x00000001 */
#define LVDS_PMBCR1_MST_EN_BIAS_DL0                            LVDS_PMBCR1_MST_EN_BIAS_DL0_Msk                                  /*!< Enable the local bias at data lane0 */
#define LVDS_PMBCR1_MST_EN_BIAS_DL1_Pos                        (4U)
#define LVDS_PMBCR1_MST_EN_BIAS_DL1_Msk                        (0x1UL << LVDS_PMBCR1_MST_EN_BIAS_DL1_Pos)                        /*!< 0x00000010 */
#define LVDS_PMBCR1_MST_EN_BIAS_DL1                            LVDS_PMBCR1_MST_EN_BIAS_DL1_Msk                                  /*!< Enable the local bias at data lane1 */
#define LVDS_PMBCR1_MST_EN_BIAS_DL2_Pos                        (8U)
#define LVDS_PMBCR1_MST_EN_BIAS_DL2_Msk                        (0x1UL << LVDS_PMBCR1_MST_EN_BIAS_DL2_Pos)                        /*!< 0x00000100 */
#define LVDS_PMBCR1_MST_EN_BIAS_DL2                            LVDS_PMBCR1_MST_EN_BIAS_DL2_Msk                                  /*!< Enable the local bias at data lane2 */
#define LVDS_PMBCR1_MST_EN_BIAS_DL3_Pos                        (12U)
#define LVDS_PMBCR1_MST_EN_BIAS_DL3_Msk                        (0x1UL << LVDS_PMBCR1_MST_EN_BIAS_DL3_Pos)                        /*!< 0x00001000 */
#define LVDS_PMBCR1_MST_EN_BIAS_DL3                            LVDS_PMBCR1_MST_EN_BIAS_DL3_Msk                                  /*!< Enable the local bias at data lane3 */
#define LVDS_PMBCR1_MST_EN_BIAS_DL4_Pos                        (16U)
#define LVDS_PMBCR1_MST_EN_BIAS_DL4_Msk                        (0x1UL << LVDS_PMBCR1_MST_EN_BIAS_DL4_Pos)                        /*!< 0x00010000 */
#define LVDS_PMBCR1_MST_EN_BIAS_DL4                            LVDS_PMBCR1_MST_EN_BIAS_DL4_Msk                                  /*!< Enable the local bias at data lane4 */

/*****************  Bit definition for LVDS_PMBCR2 register  ******************/
#define LVDS_PMBCR2_MST_BIAS_TRIM_Pos                          (0U)
#define LVDS_PMBCR2_MST_BIAS_TRIM_Msk                          (0x7FFFUL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                       /*!< 0x00007FFF */
#define LVDS_PMBCR2_MST_BIAS_TRIM                              LVDS_PMBCR2_MST_BIAS_TRIM_Msk                                    /*!< 0x0: 27.71uA */
#define LVDS_PMBCR2_MST_BIAS_TRIM_0                            (0x1UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                          /*!< 0x00000001 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_1                            (0x2UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                          /*!< 0x00000002 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_2                            (0x4UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                          /*!< 0x00000004 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_3                            (0x8UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                          /*!< 0x00000008 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_4                            (0x10UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                         /*!< 0x00000010 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_5                            (0x20UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                         /*!< 0x00000020 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_6                            (0x40UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                         /*!< 0x00000040 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_7                            (0x80UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                         /*!< 0x00000080 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_8                            (0x100UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                        /*!< 0x00000100 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_9                            (0x200UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                        /*!< 0x00000200 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_10                           (0x400UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                        /*!< 0x00000400 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_11                           (0x800UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                        /*!< 0x00000800 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_12                           (0x1000UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                       /*!< 0x00001000 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_13                           (0x2000UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                       /*!< 0x00002000 */
#define LVDS_PMBCR2_MST_BIAS_TRIM_14                           (0x4000UL << LVDS_PMBCR2_MST_BIAS_TRIM_Pos)                       /*!< 0x00004000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos                      (16U)
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_Msk                      (0xFFFUL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                    /*!< 0x0FFF0000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM                          LVDS_PMBCR2_MST_BIAS_VREFTRIM_Msk                                /*!< 0x1: 0.3961V 27.01 uA */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_0                        (0x1UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                  /*!< 0x00010000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_1                        (0x2UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                  /*!< 0x00020000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_2                        (0x4UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                  /*!< 0x00040000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_3                        (0x8UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                  /*!< 0x00080000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_4                        (0x10UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                 /*!< 0x00100000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_5                        (0x20UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                 /*!< 0x00200000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_6                        (0x40UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                 /*!< 0x00400000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_7                        (0x80UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                 /*!< 0x00800000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_8                        (0x100UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                /*!< 0x01000000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_9                        (0x200UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                /*!< 0x02000000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_10                       (0x400UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                /*!< 0x04000000 */
#define LVDS_PMBCR2_MST_BIAS_VREFTRIM_11                       (0x800UL << LVDS_PMBCR2_MST_BIAS_VREFTRIM_Pos)                /*!< 0x08000000 */
#define LVDS_PMBCR2_MST_BIAS_EN_Pos                            (28U)
#define LVDS_PMBCR2_MST_BIAS_EN_Msk                            (0x1UL << LVDS_PMBCR2_MST_BIAS_EN_Pos)                            /*!< 0x10000000 */
#define LVDS_PMBCR2_MST_BIAS_EN                                LVDS_PMBCR2_MST_BIAS_EN_Msk                                      /*!< lvds macro global bias enable */
#define LVDS_PMBCR2_MST_BIAS_VREF_SEL_Pos                      (29U)
#define LVDS_PMBCR2_MST_BIAS_VREF_SEL_Msk                      (0x1UL << LVDS_PMBCR2_MST_BIAS_VREF_SEL_Pos)                      /*!< 0x20000000 */
#define LVDS_PMBCR2_MST_BIAS_VREF_SEL                          LVDS_PMBCR2_MST_BIAS_VREF_SEL_Msk                                /*!< Selection for current generation internal reference */

