STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255dxx_ca35.h
/*****************  Bit definition for LVDS_PSDTCR2 register  *****************/
#define LVDS_PSDTCR2_PSDTDL4_Pos                               (0U)
#define LVDS_PSDTCR2_PSDTDL4_Msk                               (0xFFUL << LVDS_PSDTCR2_PSDTDL4_Pos)                              /*!< 0x000000FF */
#define LVDS_PSDTCR2_PSDTDL4                                   LVDS_PSDTCR2_PSDTDL4_Msk                                         /*!< PHY Slave Digital Test Data Lane 4. */
#define LVDS_PSDTCR2_PSDTDL4_0                                 (0x1UL << LVDS_PSDTCR2_PSDTDL4_Pos)                               /*!< 0x00000001 */
#define LVDS_PSDTCR2_PSDTDL4_1                                 (0x2UL << LVDS_PSDTCR2_PSDTDL4_Pos)                               /*!< 0x00000002 */
#define LVDS_PSDTCR2_PSDTDL4_2                                 (0x4UL << LVDS_PSDTCR2_PSDTDL4_Pos)                               /*!< 0x00000004 */
#define LVDS_PSDTCR2_PSDTDL4_3                                 (0x8UL << LVDS_PSDTCR2_PSDTDL4_Pos)                               /*!< 0x00000008 */
#define LVDS_PSDTCR2_PSDTDL4_4                                 (0x10UL << LVDS_PSDTCR2_PSDTDL4_Pos)                              /*!< 0x00000010 */
#define LVDS_PSDTCR2_PSDTDL4_5                                 (0x20UL << LVDS_PSDTCR2_PSDTDL4_Pos)                              /*!< 0x00000020 */
#define LVDS_PSDTCR2_PSDTDL4_6                                 (0x40UL << LVDS_PSDTCR2_PSDTDL4_Pos)                              /*!< 0x00000040 */
#define LVDS_PSDTCR2_PSDTDL4_7                                 (0x80UL << LVDS_PSDTCR2_PSDTDL4_Pos)                              /*!< 0x00000080 */
#define LVDS_PSDTCR2_PSDTMC_Pos                                (8U)
#define LVDS_PSDTCR2_PSDTMC_Msk                                (0x7FUL << LVDS_PSDTCR2_PSDTMC_Pos)                               /*!< 0x00007F00 */
#define LVDS_PSDTCR2_PSDTMC                                    LVDS_PSDTCR2_PSDTMC_Msk                                          /*!< Phy Slave Digital Test Mux Control */
#define LVDS_PSDTCR2_PSDTMC_0                                  (0x1UL << LVDS_PSDTCR2_PSDTMC_Pos)                              /*!< 0x00000100 */
#define LVDS_PSDTCR2_PSDTMC_1                                  (0x2UL << LVDS_PSDTCR2_PSDTMC_Pos)                              /*!< 0x00000200 */
#define LVDS_PSDTCR2_PSDTMC_2                                  (0x4UL << LVDS_PSDTCR2_PSDTMC_Pos)                              /*!< 0x00000400 */
#define LVDS_PSDTCR2_PSDTMC_3                                  (0x8UL << LVDS_PSDTCR2_PSDTMC_Pos)                              /*!< 0x00000800 */
#define LVDS_PSDTCR2_PSDTMC_4                                  (0x10UL << LVDS_PSDTCR2_PSDTMC_Pos)                             /*!< 0x00001000 */
#define LVDS_PSDTCR2_PSDTMC_5                                  (0x20UL << LVDS_PSDTCR2_PSDTMC_Pos)                             /*!< 0x00002000 */
#define LVDS_PSDTCR2_PSDTMC_6                                  (0x40UL << LVDS_PSDTCR2_PSDTMC_Pos)                             /*!< 0x00004000 */

/*****************  Bit definition for LVDS_PSDTSR register  ******************/
#define LVDS_PSDTSR_PSDTDLS0_Pos                               (0U)
#define LVDS_PSDTSR_PSDTDLS0_Msk                               (0x1UL << LVDS_PSDTSR_PSDTDLS0_Pos)                               /*!< 0x00000001 */
#define LVDS_PSDTSR_PSDTDLS0                                   LVDS_PSDTSR_PSDTDLS0_Msk                                         /*!< Phy Slave Digital Test Data Lane Status 0. */
#define LVDS_PSDTSR_PSDTDLS1_Pos                               (1U)
#define LVDS_PSDTSR_PSDTDLS1_Msk                               (0x1UL << LVDS_PSDTSR_PSDTDLS1_Pos)                               /*!< 0x00000002 */
#define LVDS_PSDTSR_PSDTDLS1                                   LVDS_PSDTSR_PSDTDLS1_Msk                                         /*!< Phy Slave Digital Test Data Lane Status 1. */
#define LVDS_PSDTSR_PSDTDLS2_Pos                               (2U)
#define LVDS_PSDTSR_PSDTDLS2_Msk                               (0x1UL << LVDS_PSDTSR_PSDTDLS2_Pos)                               /*!< 0x00000004 */
#define LVDS_PSDTSR_PSDTDLS2                                   LVDS_PSDTSR_PSDTDLS2_Msk                                         /*!< Phy Slave Digital Test Data Lane Status 2. */
#define LVDS_PSDTSR_PSDTDLS3_Pos                               (3U)
#define LVDS_PSDTSR_PSDTDLS3_Msk                               (0x1UL << LVDS_PSDTSR_PSDTDLS3_Pos)                               /*!< 0x00000008 */
#define LVDS_PSDTSR_PSDTDLS3                                   LVDS_PSDTSR_PSDTDLS3_Msk                                         /*!< Phy Slave Digital Test Data Lane Status 3. */
#define LVDS_PSDTSR_PSDTDLS4_Pos                               (4U)
#define LVDS_PSDTSR_PSDTDLS4_Msk                               (0x1UL << LVDS_PSDTSR_PSDTDLS4_Pos)                               /*!< 0x00000010 */
#define LVDS_PSDTSR_PSDTDLS4                                   LVDS_PSDTSR_PSDTDLS4_Msk                                         /*!< Phy Slave Digital Test Data Lane Status 4. */
#define LVDS_PSDTSR_PSDTPS_Pos                                 (5U)
#define LVDS_PSDTSR_PSDTPS_Msk                                 (0x1UL << LVDS_PSDTSR_PSDTPS_Pos)                                 /*!< 0x00000020 */
#define LVDS_PSDTSR_PSDTPS                                     LVDS_PSDTSR_PSDTPS_Msk                                           /*!< Phy Slave Digital Test PLL Status */

/*****************  Bit definition for LVDS_HWCFGR register  ******************/
#define LVDS_HWCFGR_TECHNO_Pos                                 (0U)
#define LVDS_HWCFGR_TECHNO_Msk                                 (0xFUL << LVDS_HWCFGR_TECHNO_Pos)                                 /*!< 0x0000000F */
#define LVDS_HWCFGR_TECHNO                                     LVDS_HWCFGR_TECHNO_Msk                                           /*!< Techno (and version) of PHY used: */
#define LVDS_HWCFGR_TECHNO_0                                   (0x1UL << LVDS_HWCFGR_TECHNO_Pos)                                 /*!< 0x00000001 */
#define LVDS_HWCFGR_TECHNO_1                                   (0x2UL << LVDS_HWCFGR_TECHNO_Pos)                                 /*!< 0x00000002 */
#define LVDS_HWCFGR_TECHNO_2                                   (0x4UL << LVDS_HWCFGR_TECHNO_Pos)                                 /*!< 0x00000004 */
#define LVDS_HWCFGR_TECHNO_3                                   (0x8UL << LVDS_HWCFGR_TECHNO_Pos)                                 /*!< 0x00000008 */
#define LVDS_HWCFGR_LANES_Pos                                  (4U)
#define LVDS_HWCFGR_LANES_Msk                                  (0xFUL << LVDS_HWCFGR_LANES_Pos)                                  /*!< 0x000000F0 */
#define LVDS_HWCFGR_LANES                                      LVDS_HWCFGR_LANES_Msk                                            /*!< amount of LVDS PHY Lanes (including the LVDS PHY ClockLane) in one Link. */
#define LVDS_HWCFGR_LANES_0                                    (0x1UL << LVDS_HWCFGR_LANES_Pos)                                 /*!< 0x00000010 */
#define LVDS_HWCFGR_LANES_1                                    (0x2UL << LVDS_HWCFGR_LANES_Pos)                                 /*!< 0x00000020 */
#define LVDS_HWCFGR_LANES_2                                    (0x4UL << LVDS_HWCFGR_LANES_Pos)                                 /*!< 0x00000040 */
#define LVDS_HWCFGR_LANES_3                                    (0x8UL << LVDS_HWCFGR_LANES_Pos)                                 /*!< 0x00000080 */
#define LVDS_HWCFGR_LINKS_Pos                                  (8U)
#define LVDS_HWCFGR_LINKS_Msk                                  (0xFUL << LVDS_HWCFGR_LINKS_Pos)                                  /*!< 0x00000F00 */
#define LVDS_HWCFGR_LINKS                                      LVDS_HWCFGR_LINKS_Msk                                            /*!< amount of LVDS PHY Links. */
#define LVDS_HWCFGR_LINKS_0                                    (0x1UL << LVDS_HWCFGR_LINKS_Pos)                                /*!< 0x00000100 */
#define LVDS_HWCFGR_LINKS_1                                    (0x2UL << LVDS_HWCFGR_LINKS_Pos)                                /*!< 0x00000200 */
#define LVDS_HWCFGR_LINKS_2                                    (0x4UL << LVDS_HWCFGR_LINKS_Pos)                                /*!< 0x00000400 */
#define LVDS_HWCFGR_LINKS_3                                    (0x8UL << LVDS_HWCFGR_LINKS_Pos)                                /*!< 0x00000800 */

/******************  Bit definition for LVDS_VERR register  *******************/
#define LVDS_VERR_MINREV_Pos                                   (0U)
#define LVDS_VERR_MINREV_Msk                                   (0xFUL << LVDS_VERR_MINREV_Pos)                                   /*!< 0x0000000F */
#define LVDS_VERR_MINREV                                       LVDS_VERR_MINREV_Msk                                             /*!< Minor Revision of the LVDS PHY Host */
#define LVDS_VERR_MINREV_0                                     (0x1UL << LVDS_VERR_MINREV_Pos)                                   /*!< 0x00000001 */
#define LVDS_VERR_MINREV_1                                     (0x2UL << LVDS_VERR_MINREV_Pos)                                   /*!< 0x00000002 */
#define LVDS_VERR_MINREV_2                                     (0x4UL << LVDS_VERR_MINREV_Pos)                                   /*!< 0x00000004 */
#define LVDS_VERR_MINREV_3                                     (0x8UL << LVDS_VERR_MINREV_Pos)                                   /*!< 0x00000008 */
#define LVDS_VERR_MAJREV_Pos                                   (4U)
#define LVDS_VERR_MAJREV_Msk                                   (0xFUL << LVDS_VERR_MAJREV_Pos)                                   /*!< 0x000000F0 */
#define LVDS_VERR_MAJREV                                       LVDS_VERR_MAJREV_Msk                                             /*!< Major Revision of the LVDS PHY Host */
#define LVDS_VERR_MAJREV_0                                     (0x1UL << LVDS_VERR_MAJREV_Pos)                                  /*!< 0x00000010 */
#define LVDS_VERR_MAJREV_1                                     (0x2UL << LVDS_VERR_MAJREV_Pos)                                  /*!< 0x00000020 */
#define LVDS_VERR_MAJREV_2                                     (0x4UL << LVDS_VERR_MAJREV_Pos)                                  /*!< 0x00000040 */
#define LVDS_VERR_MAJREV_3                                     (0x8UL << LVDS_VERR_MAJREV_Pos)                                  /*!< 0x00000080 */

/******************  Bit definition for LVDS_IPIDR register  ******************/
#define LVDS_IPIDR_IDR_Pos                                     (0U)
#define LVDS_IPIDR_IDR_Msk                                     (0xFFFFFFFFUL << LVDS_IPIDR_IDR_Pos)                              /*!< 0xFFFFFFFF */
#define LVDS_IPIDR_IDR                                         LVDS_IPIDR_IDR_Msk                                               /*!< LVDS PHY Host Identification: 0x0016_00A1 */
#define LVDS_IPIDR_IDR_0                                       (0x1UL << LVDS_IPIDR_IDR_Pos)                                     /*!< 0x00000001 */
#define LVDS_IPIDR_IDR_1                                       (0x2UL << LVDS_IPIDR_IDR_Pos)                                     /*!< 0x00000002 */
#define LVDS_IPIDR_IDR_2                                       (0x4UL << LVDS_IPIDR_IDR_Pos)                                     /*!< 0x00000004 */
#define LVDS_IPIDR_IDR_3                                       (0x8UL << LVDS_IPIDR_IDR_Pos)                                     /*!< 0x00000008 */
#define LVDS_IPIDR_IDR_4                                       (0x10UL << LVDS_IPIDR_IDR_Pos)                                    /*!< 0x00000010 */
#define LVDS_IPIDR_IDR_5                                       (0x20UL << LVDS_IPIDR_IDR_Pos)                                    /*!< 0x00000020 */
#define LVDS_IPIDR_IDR_6                                       (0x40UL << LVDS_IPIDR_IDR_Pos)                                    /*!< 0x00000040 */
#define LVDS_IPIDR_IDR_7                                       (0x80UL << LVDS_IPIDR_IDR_Pos)                                    /*!< 0x00000080 */
#define LVDS_IPIDR_IDR_8                                       (0x100UL << LVDS_IPIDR_IDR_Pos)                                   /*!< 0x00000100 */
#define LVDS_IPIDR_IDR_9                                       (0x200UL << LVDS_IPIDR_IDR_Pos)                                   /*!< 0x00000200 */
#define LVDS_IPIDR_IDR_10                                      (0x400UL << LVDS_IPIDR_IDR_Pos)                                   /*!< 0x00000400 */
#define LVDS_IPIDR_IDR_11                                      (0x800UL << LVDS_IPIDR_IDR_Pos)                                   /*!< 0x00000800 */
#define LVDS_IPIDR_IDR_12                                      (0x1000UL << LVDS_IPIDR_IDR_Pos)                                  /*!< 0x00001000 */
#define LVDS_IPIDR_IDR_13                                      (0x2000UL << LVDS_IPIDR_IDR_Pos)                                  /*!< 0x00002000 */
#define LVDS_IPIDR_IDR_14                                      (0x4000UL << LVDS_IPIDR_IDR_Pos)                                  /*!< 0x00004000 */
#define LVDS_IPIDR_IDR_15                                      (0x8000UL << LVDS_IPIDR_IDR_Pos)                                  /*!< 0x00008000 */
#define LVDS_IPIDR_IDR_16                                      (0x10000UL << LVDS_IPIDR_IDR_Pos)                                 /*!< 0x00010000 */
#define LVDS_IPIDR_IDR_17                                      (0x20000UL << LVDS_IPIDR_IDR_Pos)                                 /*!< 0x00020000 */
#define LVDS_IPIDR_IDR_18                                      (0x40000UL << LVDS_IPIDR_IDR_Pos)                                 /*!< 0x00040000 */
#define LVDS_IPIDR_IDR_19                                      (0x80000UL << LVDS_IPIDR_IDR_Pos)                                 /*!< 0x00080000 */
#define LVDS_IPIDR_IDR_20                                      (0x100000UL << LVDS_IPIDR_IDR_Pos)                                /*!< 0x00100000 */
#define LVDS_IPIDR_IDR_21                                      (0x200000UL << LVDS_IPIDR_IDR_Pos)                                /*!< 0x00200000 */
#define LVDS_IPIDR_IDR_22                                      (0x400000UL << LVDS_IPIDR_IDR_Pos)                                /*!< 0x00400000 */
#define LVDS_IPIDR_IDR_23                                      (0x800000UL << LVDS_IPIDR_IDR_Pos)                                /*!< 0x00800000 */
#define LVDS_IPIDR_IDR_24                                      (0x1000000UL << LVDS_IPIDR_IDR_Pos)                               /*!< 0x01000000 */
#define LVDS_IPIDR_IDR_25                                      (0x2000000UL << LVDS_IPIDR_IDR_Pos)                               /*!< 0x02000000 */
#define LVDS_IPIDR_IDR_26                                      (0x4000000UL << LVDS_IPIDR_IDR_Pos)                               /*!< 0x04000000 */
#define LVDS_IPIDR_IDR_27                                      (0x8000000UL << LVDS_IPIDR_IDR_Pos)                               /*!< 0x08000000 */
#define LVDS_IPIDR_IDR_28                                      (0x10000000UL << LVDS_IPIDR_IDR_Pos)                              /*!< 0x10000000 */
#define LVDS_IPIDR_IDR_29                                      (0x20000000UL << LVDS_IPIDR_IDR_Pos)                              /*!< 0x20000000 */
#define LVDS_IPIDR_IDR_30                                      (0x40000000UL << LVDS_IPIDR_IDR_Pos)                              /*!< 0x40000000 */
#define LVDS_IPIDR_IDR_31                                      (0x80000000UL << LVDS_IPIDR_IDR_Pos)                              /*!< 0x80000000 */

