STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255dxx_ca35.h
/* Bit fields for RCC_SDMMC1CFGR register */
#define RCC_SDMMC1CFGR_SDMMC1RST_Pos                 (0U)
#define RCC_SDMMC1CFGR_SDMMC1RST_Msk                 (0x1UL << RCC_SDMMC1CFGR_SDMMC1RST_Pos)                /*!< 0x00000001 */
#define RCC_SDMMC1CFGR_SDMMC1RST                     RCC_SDMMC1CFGR_SDMMC1RST_Msk                          /*!< SDMMC1 reset */
#define RCC_SDMMC1CFGR_SDMMC1EN_Pos                  (1U)
#define RCC_SDMMC1CFGR_SDMMC1EN_Msk                  (0x1UL << RCC_SDMMC1CFGR_SDMMC1EN_Pos)                 /*!< 0x00000002 */
#define RCC_SDMMC1CFGR_SDMMC1EN                      RCC_SDMMC1CFGR_SDMMC1EN_Msk                           /*!< SDMMC1 clock enable */
#define RCC_SDMMC1CFGR_SDMMC1LPEN_Pos                (2U)
#define RCC_SDMMC1CFGR_SDMMC1LPEN_Msk                (0x1UL << RCC_SDMMC1CFGR_SDMMC1LPEN_Pos)               /*!< 0x00000004 */
#define RCC_SDMMC1CFGR_SDMMC1LPEN                    RCC_SDMMC1CFGR_SDMMC1LPEN_Msk                         /*!< SDMMC1 clock enable during CSleep */
#define RCC_SDMMC1CFGR_SDMMC1DLLRST_Pos              (16U)
#define RCC_SDMMC1CFGR_SDMMC1DLLRST_Msk              (0x1UL << RCC_SDMMC1CFGR_SDMMC1DLLRST_Pos)             /*!< 0x00010000 */
#define RCC_SDMMC1CFGR_SDMMC1DLLRST                  RCC_SDMMC1CFGR_SDMMC1DLLRST_Msk                       /*!< SDMMC1 DLL reset */

/* Bit fields for RCC_SDMMC2CFGR register */
#define RCC_SDMMC2CFGR_SDMMC2RST_Pos                 (0U)
#define RCC_SDMMC2CFGR_SDMMC2RST_Msk                 (0x1UL << RCC_SDMMC2CFGR_SDMMC2RST_Pos)                /*!< 0x00000001 */
#define RCC_SDMMC2CFGR_SDMMC2RST                     RCC_SDMMC2CFGR_SDMMC2RST_Msk                          /*!< SDMMC2 reset */
#define RCC_SDMMC2CFGR_SDMMC2EN_Pos                  (1U)
#define RCC_SDMMC2CFGR_SDMMC2EN_Msk                  (0x1UL << RCC_SDMMC2CFGR_SDMMC2EN_Pos)                 /*!< 0x00000002 */
#define RCC_SDMMC2CFGR_SDMMC2EN                      RCC_SDMMC2CFGR_SDMMC2EN_Msk                           /*!< SDMMC2 clock enable */
#define RCC_SDMMC2CFGR_SDMMC2LPEN_Pos                (2U)
#define RCC_SDMMC2CFGR_SDMMC2LPEN_Msk                (0x1UL << RCC_SDMMC2CFGR_SDMMC2LPEN_Pos)               /*!< 0x00000004 */
#define RCC_SDMMC2CFGR_SDMMC2LPEN                    RCC_SDMMC2CFGR_SDMMC2LPEN_Msk                         /*!< SDMMC2 clock enable during CSleep */
#define RCC_SDMMC2CFGR_SDMMC2DLLRST_Pos              (16U)
#define RCC_SDMMC2CFGR_SDMMC2DLLRST_Msk              (0x1UL << RCC_SDMMC2CFGR_SDMMC2DLLRST_Pos)             /*!< 0x00010000 */
#define RCC_SDMMC2CFGR_SDMMC2DLLRST                  RCC_SDMMC2CFGR_SDMMC2DLLRST_Msk                       /*!< SDMMC2 DLL reset */

/* Bit fields for RCC_SDMMC3CFGR register */
#define RCC_SDMMC3CFGR_SDMMC3RST_Pos                 (0U)
#define RCC_SDMMC3CFGR_SDMMC3RST_Msk                 (0x1UL << RCC_SDMMC3CFGR_SDMMC3RST_Pos)                /*!< 0x00000001 */
#define RCC_SDMMC3CFGR_SDMMC3RST                     RCC_SDMMC3CFGR_SDMMC3RST_Msk                          /*!< SDMMC3 block reset */
#define RCC_SDMMC3CFGR_SDMMC3EN_Pos                  (1U)
#define RCC_SDMMC3CFGR_SDMMC3EN_Msk                  (0x1UL << RCC_SDMMC3CFGR_SDMMC3EN_Pos)                 /*!< 0x00000002 */
#define RCC_SDMMC3CFGR_SDMMC3EN                      RCC_SDMMC3CFGR_SDMMC3EN_Msk                           /*!< SDMMC3 clock enable */
#define RCC_SDMMC3CFGR_SDMMC3LPEN_Pos                (2U)
#define RCC_SDMMC3CFGR_SDMMC3LPEN_Msk                (0x1UL << RCC_SDMMC3CFGR_SDMMC3LPEN_Pos)               /*!< 0x00000004 */
#define RCC_SDMMC3CFGR_SDMMC3LPEN                    RCC_SDMMC3CFGR_SDMMC3LPEN_Msk                         /*!< SDMMC3 clock enable during CSleep */
#define RCC_SDMMC3CFGR_SDMMC3DLLRST_Pos              (16U)
#define RCC_SDMMC3CFGR_SDMMC3DLLRST_Msk              (0x1UL << RCC_SDMMC3CFGR_SDMMC3DLLRST_Pos)             /*!< 0x00010000 */
#define RCC_SDMMC3CFGR_SDMMC3DLLRST                  RCC_SDMMC3CFGR_SDMMC3DLLRST_Msk                       /*!< SDMMC3 DLL reset */

/* Bit fields for RCC_GPUCFGR register */
#define RCC_GPUCFGR_GPURST_Pos                       (0U)
#define RCC_GPUCFGR_GPURST_Msk                       (0x1UL << RCC_GPUCFGR_GPURST_Pos)                      /*!< 0x00000001 */
#define RCC_GPUCFGR_GPURST                           RCC_GPUCFGR_GPURST_Msk                                /*!< GPU reset */
#define RCC_GPUCFGR_GPUEN_Pos                        (1U)
#define RCC_GPUCFGR_GPUEN_Msk                        (0x1UL << RCC_GPUCFGR_GPUEN_Pos)                       /*!< 0x00000002 */
#define RCC_GPUCFGR_GPUEN                            RCC_GPUCFGR_GPUEN_Msk                                 /*!< GPU clock enable */
#define RCC_GPUCFGR_GPULPEN_Pos                      (2U)
#define RCC_GPUCFGR_GPULPEN_Msk                      (0x1UL << RCC_GPUCFGR_GPULPEN_Pos)                     /*!< 0x00000004 */
#define RCC_GPUCFGR_GPULPEN                          RCC_GPUCFGR_GPULPEN_Msk                               /*!< GPU clock enable during CSleep  */

/* Bit fields for RCC_LTDCCFGR register */
#define RCC_LTDCCFGR_LTDCRST_Pos                     (0U)
#define RCC_LTDCCFGR_LTDCRST_Msk                     (0x1UL << RCC_LTDCCFGR_LTDCRST_Pos)                    /*!< 0x00000001 */
#define RCC_LTDCCFGR_LTDCRST                         RCC_LTDCCFGR_LTDCRST_Msk                              /*!< LTDC reset */
#define RCC_LTDCCFGR_LTDCEN_Pos                      (1U)
#define RCC_LTDCCFGR_LTDCEN_Msk                      (0x1UL << RCC_LTDCCFGR_LTDCEN_Pos)                     /*!< 0x00000002 */
#define RCC_LTDCCFGR_LTDCEN                          RCC_LTDCCFGR_LTDCEN_Msk                               /*!< LTDC peripheral clock enable */
#define RCC_LTDCCFGR_LTDCLPEN_Pos                    (2U)
#define RCC_LTDCCFGR_LTDCLPEN_Msk                    (0x1UL << RCC_LTDCCFGR_LTDCLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_LTDCCFGR_LTDCLPEN                        RCC_LTDCCFGR_LTDCLPEN_Msk                             /*!< LTDC clock enable during CSleep  */

/* Bit fields for RCC_DSICFGR register */
#define RCC_DSICFGR_DSIRST_Pos                       (0U)
#define RCC_DSICFGR_DSIRST_Msk                       (0x1UL << RCC_DSICFGR_DSIRST_Pos)                      /*!< 0x00000001 */
#define RCC_DSICFGR_DSIRST                           RCC_DSICFGR_DSIRST_Msk                                /*!< DSI reset */
#define RCC_DSICFGR_DSIEN_Pos                        (1U)
#define RCC_DSICFGR_DSIEN_Msk                        (0x1UL << RCC_DSICFGR_DSIEN_Pos)                       /*!< 0x00000002 */
#define RCC_DSICFGR_DSIEN                            RCC_DSICFGR_DSIEN_Msk                                 /*!< DSI clock enable */
#define RCC_DSICFGR_DSILPEN_Pos                      (2U)
#define RCC_DSICFGR_DSILPEN_Msk                      (0x1UL << RCC_DSICFGR_DSILPEN_Pos)                     /*!< 0x00000004 */
#define RCC_DSICFGR_DSILPEN                          RCC_DSICFGR_DSILPEN_Msk                               /*!< DSI clock enable during CSleep  */
#define RCC_DSICFGR_DSIBLSEL_Pos                     (12U)
#define RCC_DSICFGR_DSIBLSEL_Msk                     (0x1UL << RCC_DSICFGR_DSIBLSEL_Pos)                    /*!< 0x00001000 */
#define RCC_DSICFGR_DSIBLSEL                         RCC_DSICFGR_DSIBLSEL_Msk                              /*!< DSI byte lane clock source selection */
#define RCC_DSICFGR_DSIPHYCKREFSEL_Pos               (15U)
#define RCC_DSICFGR_DSIPHYCKREFSEL_Msk               (0x1UL << RCC_DSICFGR_DSIPHYCKREFSEL_Pos)              /*!< 0x00008000 */
#define RCC_DSICFGR_DSIPHYCKREFSEL                   RCC_DSICFGR_DSIPHYCKREFSEL_Msk                        /*!< DSIPHY reference clock selection */

/* Bit fields for RCC_LVDSCFGR register */
#define RCC_LVDSCFGR_LVDSRST_Pos                     (0U)
#define RCC_LVDSCFGR_LVDSRST_Msk                     (0x1UL << RCC_LVDSCFGR_LVDSRST_Pos)                    /*!< 0x00000001 */
#define RCC_LVDSCFGR_LVDSRST                         RCC_LVDSCFGR_LVDSRST_Msk                              /*!< LVDS reset */
#define RCC_LVDSCFGR_LVDSEN_Pos                      (1U)
#define RCC_LVDSCFGR_LVDSEN_Msk                      (0x1UL << RCC_LVDSCFGR_LVDSEN_Pos)                     /*!< 0x00000002 */
#define RCC_LVDSCFGR_LVDSEN                          RCC_LVDSCFGR_LVDSEN_Msk                               /*!< LVDSPHY clock enable */
#define RCC_LVDSCFGR_LVDSLPEN_Pos                    (2U)
#define RCC_LVDSCFGR_LVDSLPEN_Msk                    (0x1UL << RCC_LVDSCFGR_LVDSLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_LVDSCFGR_LVDSLPEN                        RCC_LVDSCFGR_LVDSLPEN_Msk                             /*!< LVDSPHY clock enable during CSleep  */
#define RCC_LVDSCFGR_LVDSPHYCKREFSEL_Pos             (15U)
#define RCC_LVDSCFGR_LVDSPHYCKREFSEL_Msk             (0x1UL << RCC_LVDSCFGR_LVDSPHYCKREFSEL_Pos)            /*!< 0x00008000 */
#define RCC_LVDSCFGR_LVDSPHYCKREFSEL                 RCC_LVDSCFGR_LVDSPHYCKREFSEL_Msk                      /*!< LVDSPHY reference clock select */

/* Bit fields for RCC_CSI2CFGR register */
#define RCC_CSI2CFGR_CSI2RST_Pos                     (0U)
#define RCC_CSI2CFGR_CSI2RST_Msk                     (0x1UL << RCC_CSI2CFGR_CSI2RST_Pos)
#define RCC_CSI2CFGR_CSI2RST                         RCC_CSI2CFGR_CSI2RST_Msk
#define RCC_CSI2CFGR_CSI2EN_Pos                      (1U)
#define RCC_CSI2CFGR_CSI2EN_Msk                      (0x1UL << RCC_CSI2CFGR_CSI2EN_Pos)
#define RCC_CSI2CFGR_CSI2EN                          RCC_CSI2CFGR_CSI2EN_Msk
#define RCC_CSI2CFGR_CSI2LPEN_Pos                    (2U)
#define RCC_CSI2CFGR_CSI2LPEN_Msk                    (0x1UL << RCC_CSI2CFGR_CSI2LPEN_Pos)
#define RCC_CSI2CFGR_CSI2LPEN                        RCC_CSI2CFGR_CSI2LPEN_Msk

